kucukemirhan/STM32F4_grap/include/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ENC1_CH2_Pin GPIO_PIN_1
#define ENC1_CH2_GPIO_Port GPIOA
#define ENC1_CH1_Pin GPIO_PIN_5
#define ENC1_CH1_GPIO_Port GPIOA
#define PULSE1_Pin GPIO_PIN_6
#define PULSE1_GPIO_Port GPIOA
#define DIR2_Pin GPIO_PIN_7
#define DIR2_GPIO_Port GPIOA
#define DIR1_Pin GPIO_PIN_1
#define DIR1_GPIO_Port GPIOB
#define ENC2_CH1_Pin GPIO_PIN_12
#define ENC2_CH1_GPIO_Port GPIOD
#define ENC2_CH2_Pin GPIO_PIN_13
#define ENC2_CH2_GPIO_Port GPIOD
#define RED_LED_Pin GPIO_PIN_14
#define RED_LED_GPIO_Port GPIOD
#define BLUE_LED_Pin GPIO_PIN_15
#define BLUE_LED_GPIO_Port GPIOD
#define PULSE2_Pin GPIO_PIN_6
#define PULSE2_GPIO_Port GPIOC
#define CAN_RX1_Pin GPIO_PIN_0
#define CAN_RX1_GPIO_Port GPIOD
#define CAN_TX1_Pin GPIO_PIN_1
#define CAN_TX1_GPIO_Port GPIOD

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
